---
kind: property
id: P:Autodesk.Revit.DB.ColorBackgroundSettings.Color
zh: 着色、上色、染色、填色
source: html/85ab2fb1-ac8f-58a7-d24f-cd8ed5990625.htm
---
# Autodesk.Revit.DB.ColorBackgroundSettings.Color Property

**中文**: 着色、上色、染色、填色

The color of the rendering background.

## Syntax (C#)
```csharp
public Color Color { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null